const vueItems = [
    { text: '🔹 Vue自称渐进式框架，你如何理解“渐进式”的含义？', link: '/web/vue/Vue自称渐进式框架，你如何理解“渐进式”的含义？' },
    { text: '🏴 谈谈你对MVVM的理解', link: '/web/vue/谈谈你对MVVM的理解' },
    { text: '🚩 Vue的生命周期', link: '/web/vue/Vue的生命周期' },
    { text: '🚩 路由模式Hash和History有什么区别？', link: '/web/vue/路由模式Hash和History有什么区别？' },
    { text: '🚩 v-for为什么需要加key？', link: '/web/vue/v-for为什么需要加key？' },
    { text: '🚩 v-for为什么不能和v-if在同一个元素中使用？', link: '/web/vue/v-for为什么不能和v-if在同一个元素中使用？' },
    { text: '🔸 v-for中使用动态组件', link: '/web/vue/v-for中使用动态组件' },
    { text: '🏴 Vue中props和data哪个优先级更高？', link: '/web/vue/Vue中props和data哪个优先级更高？' },
    { text: '🚩 watch和computed的区别', link: '/web/vue/watch和computed的区别' },
    { text: '🚩 keep-live是什么？如何使用？', link: '/web/vue/keep-live是什么？如何使用？' },
    { text: '🏴 Diff 算法', link: '/web/vue/diff算法' },
    { text: '🚩 Vue打包部署Nginx后页面路径刷新404的问题', link: '/web/vue/Vue打包部署Nginx后页面路径刷新404的问题' }
];

export default vueItems;
